{"text":"Cognizant of the growing popularity of solar photovoltaic (PV) installations amongst residential\ndwellers as well as building developers, and the corresponding demand for a comprehensive\nset of technical and regulatory information, the Energy Market Authority (EMA) and the Building\nConstruction Authority (BCA) got together earlier this year to work on integrating their respective\nsolar manuals into an all-in-one reference guide for those who are keen on installing solar PV\nsystems in Singapore.","metadata":499}
{"text":"The outcome of this joint project, which also saw the involvement of industry partners and\nstakeholders such as Phoenix Solar Pte Ltd, Grenzone Pte Ltd, Solar Energy Research Institute\nof Singapore (SERIS) and Singapore Polytechnic, is this \"Handbook for Solar Photovoltaic (PV)\nSystems\". Through this integrated and revised handbook, we hope to be able to provide a\ncomprehensive guide to the relevant parties, including owners, developers, engineers, architects,\nLicensed Electrical Workers and electricians on the key issues, requirements and processes\npertaining to the installation of solar PV systems.","metadata":607}
{"text":"As with the previous edition of the handbooks, this single volume covers and provides information\non licensing, market and technical requirements, and building and structural issues that are related\nto the implementation of solar PV systems in a building environment. In addition, it provides new\ninformation on the installation requirements for solar PV systems, operations and recommended\npreventive maintenance works, and various incentives to promote solar PV systems in Singapore.\nWe have also refreshed the presentation of the handbook to make it more accessible and readerfriendly,\nas well as to incorporate examples of completed solar PV installations in Singapore. We hope you will find this to be a useful guide.","metadata":722}
{"text":"We would like to thank the following organisations for their support and contributions in\nthe development of this handbook:\n1) Grenzone Pte Ltd\n2) Phoenix Solar Pte Ltd\n3) Singapore Polytechnic\n4) Solar Energy Research Institute of Singapore (SERIS)\n5) SP PowerGrid\n6) Urban Redevelopment Authority","metadata":298}
{"text":"Figure 1. The difference between solar thermal and solar PV systems\n1.1 Introduction\nThe sun delivers its energy to us in two main forms: heat and light. There are two main\ntypes of solar power systems, namely, solar thermal systems that trap heat to warm up\nwater, and solar PV systems that convert sunlight directly into electricity as shown in\nFigure 1.\nWhen the PV modules are exposed to sunlight, they generate direct current (\"DC\")\nelectricity. An inverter then converts the DC into alternating current (\"AC\") electricity,\nso that it can feed into one of the building’s AC distribution boards (\"ACDB\") without\naffecting the quality of power supply.\nFigure 2. Grid-connected solar PV system configuration","metadata":709}
{"text":"1.2 Types of Solar PV System\nSolar PV systems can be classified based on the end-use application of the technology.\nThere are two main types of solar PV systems: grid-connected (or grid-tied) and off-grid\n(or stand alone) solar PV systems.\nGrid-connected solar PV systems\nThe main application of solar PV in Singapore is grid-connected, as Singapore’s main\nisland is well covered by the national power grid. Most solar PV systems are installed\non buildings or mounted on the ground if land is not a constraint. For buildings, they are\neither mounted on the roof or integrated into the building. The latter is also known as\nBuilding Integrated Photovoltaics (\"BIPV\"). With BIPV, the PV module usually displaces\nanother building component, e.g. window glass or roof\/wall cladding, thereby serving a\ndual purpose and offsetting some costs.\nThe configuration of a grid-connected solar PV system is shown in Figure 2.","metadata":912}
{"text":"A building has two parallel power supplies, one from the solar PV system and the other\nfrom the power grid. The combined power supply feeds all the loads connected to the\nmain ACDB.\nThe ratio of solar PV supply to power grid supply varies, depending on the size of the\nsolar PV system. Whenever the solar PV supply exceeds the building’s demand, excess\nelectricity will be exported into the grid. When there is no sunlight to generate PV\nelectricity at night, the power grid will supply all of the building’s demand.\nFigure 3. Off-grid solar PV system configuration\nA grid-connected system can be an effective way to reduce your dependence on utility\npower, increase renewable energy production, and improve the environment.","metadata":724}
{"text":"Off-grid solar PV systems\nOff-grid solar PV systems are applicable for areas without power grid. Currently, such\nsolar PV systems are usually installed at isolated sites where the power grid is far away,\nsuch as rural areas or off-shore islands. But they may also be installed within the city in\nsituations where it is inconvenient or too costly to tap electricity from the power grid.\nFor example, in Singapore, several URA parking sign lights are powered by off-grid solar\nPV systems.\nAn off-grid solar PV system needs deep cycle rechargeable batteries such as lead-acid,\nnickel-cadmium or lithium-ion batteries to store electricity for use under conditions\nwhere there is little or no output from the solar PV system, such as during the night, as\nshown in Figure 3 below.","metadata":774}
{"text":"1.3 Solar PV Technology\nThis section gives a brief description of the solar PV technology and the common\ntechnical terms used.\nA solar PV system is powered by many crystalline or thin film PV modules. Individual\nPV cells are interconnected to form a PV module. This takes the form of a panel for easy\ninstallation.\nPV cells are made of light-sensitive semiconductor materials that use photons to dislodge\nelectrons to drive an electric current. There are two broad categories of technology used\nfor PV cells, namely, crystalline silicon, as shown in Figure 4 which accounts for the\nmajority of PV cell production; and thin film, which is newer and growing in popularity.\nThe \"family tree\" in Figure 5 gives an overview of these technologies available today\nand Figure 6 illustrates some of these technologies.\nFigure 4. Mono-and Poly-Crystalline Silicon PV Cell\nMono-Crystalline Silicon PV Cell Poly-Crystalline Silicon PV Cell \nFigure 5. PV technology family tree\nFigure 6. Common PV module technologies\nMono-crystalline silicon\nPoly-crystalline silicon\nFlexible amorphous thin film\nCIGS thin film","metadata":1098}
{"text":"Crystalline Silicon and Thin Film Technologies\nCrystalline cells are made from ultra-pure silicon raw material such as those used in\nsemiconductor chips. They use silicon wafers that are typically 150-200 microns (one\nfifth of a millimetre) thick.\nThin film is made by depositing layers of semiconductor material barely 0.3 to 2\nmicrometres thick onto glass or stainless steel substrates. As the semiconductor layers\nare so thin, the costs of raw material are much lower than the capital equipment and\nprocessing costs.\nConversion Efficiency\nTechnology Module Efficiency\nMono-crystalline Silicon 12.5-15%\nPoly-crystalline Silicon 11-14%\nCopper Indium Gallium Selenide (CIGS) 10-13%\nCadmium Telluride (CdTe) 9-12%\nAmorphous Silicon (a-Si) 5-7%\nTable 1. Conversion efficiencies of various PV module technologies","metadata":809}
{"text":"Apart from aesthetic differences, the most obvious difference amongst PV cell\ntechnologies is in its conversion efficiency, as summarised in Table 1.\nFor example, a thin film amorphous silicon PV array will need close to twice the space\nof a crystalline silicon PV array because its module efficiency is halved, for the same\nnominal capacity under Standard Test Conditions1 (STC) rating.\nFor crystalline silicon PV modules, the module efficiency is lower compared to the sum\nof the component cell efficiency due to the presence of gaps between the cells and the\nborder around the circuit i.e., wasted space that does not generate any power hence\nlower total efficiency.","metadata":669}
{"text":"Effects of Temperature\nAnother important differentiator in solar PV performance, especially in hot climates, is\nthe temperature coefficient of power. PV cell performance declines as cell temperature\nrises.\nFor example, in bright sunlight, cell temperatures in Singapore can reach over 70ºC,\nwhereas PV modules are rated at a cell temperature of 25ºC. The loss in power output\nat 70ºC is therefore measured as (70 - 25) x temperature coefficient.\nMost thin film technologies have a lower negative temperature coefficient compared to\ncrystalline technologies. In other words, they tend to lose less of their rated capacity as\ntemperature rises. Hence, under Singapore’s climatic condition, thin film technologies\nwill generate 5-10% more electricity per year.\nA PV module data sheet should specify the temperature coefficient. See Table 2 and\nchart in Figure 7. The PV modules are next connected in series into a PV string as shown \nin Figure 8. A PV array as shown in Figure 9 is formed by the parallel aggregation of \nPV strings.\nTechnology T emperature Coefficient\n[%\/°C]\nCrystalline silicon -0.4 to -0.5\nCIGS -0.32 to -0.36\nCdTe -0.25\na-Si -0.21\nTable 2. Temperature coefficient of various PV cell technologes\nmodule output relative to STC\nFigure 7. The effects of a negative temperature\ncoefficient of power on PV module performance\nFigure 8. PV String Figure 9. PV Array","metadata":1374}
{"text":"1.4 Technical Information\nSingle-core, double isolated sheathed cables that can withstand the environmental\nconditions, and minimise the risk of earth faults and short circuits are used to interconnect\nthe PV strings and arrays. The cable connections are protected in enclosures known as\njunction box that provides the necessary connectors as shown in Figure 10.\nFigure 10. Junction Box\nElectricity produced by the solar PV installation is in the form of DC. The output of the\nPV installation is connected through the DC main cables to the DC terminals of the PV\ninverter where electricity is converted from DC into AC.\nAfter conversion, the AC current of the PV inverter is connected through PV supply\ncable to the building’s electrical installation (AC distribution board).\nFigure 11 shows a typical PV inverter connected to the electrical installation of a\nbuilding. Note that the actual configuration of the PV inverter may vary across different\nsystems.\nFigure 11. Typical PV inverter connected to a building’s electrical installation","metadata":1039}
{"text":"The PV modules are next connected in series into a PV string as shown in Figure 8.\nA PV array as shown in Figure 9 is formed by the parallel aggregation of PV strings.\nJust like any electrical installation in a building, earthing is an important safety requirement\nfor solar PV system. Arrangement must be made for proper connection of the solar PV\nsystem to the consumer’s electrical installation earthing system.\nIn locations susceptible to lightning strikes, a lightning protection system must be\nprovided, and all the exposed metallic structures of the solar PV system must be bound\nto the lightning earthing system.\nIt is the responsibility of the consumers to have their solar PV systems maintained\nregularly to ensure safe operation of their solar PV systems and electrical installations.\nSee Figure 12 for a diagram showing the solar PV system forming part of a consumer’s\nelectrical installation.\nFigure 12. Solar PV system forming part of a consumer’s electrical installation","metadata":985}
{"text":"2.1 Introduction\nThere are many examples overseas where PV modules are mounted on the roof and\nintegrated into building façades. They work particularly well in Europe and North America,\nas south-facing façades in these regions are well exposed to the sun.\nIn Singapore, we have to consider that the sun passes almost directly overhead. This is\nbecause we are located near the Equator, and the path of the sun follows the Equator,\nwith seasonal variations of up to 23.5o to the north or south. Therefore there are optimal\npositions to locate the PV modules that have to be taken into consideration. Refer to\nAppendix A for examples of solar PV systems on buildings in Singapore.","metadata":677}
{"text":"2.2 Installation Angle\nTo maximise electricity production for use in Singapore, the best location for the\nPV modules to be installed is right on top of a building, facing the sky. The possible\ninstallation options are shown in Figure 13.\nFigure 13. Where to install PV modules on a building in Singapore\nVertical façades and steeply sloped roofs tend to suffer a big loss in the ability to generate\nelectricity in exchange for higher public visibility.\nWith the PV modules facing the sky, it is possible to improve the yield by installing PV\nmodules on trackers to follow the sun from east to west during the day (single-axis\ntrackers), and from north to south during seasonal changes (dual-axis trackers).\nHowever, trackers can only improve system performance under direct sunshine, and\nthey give no advantage in diffused sunlight conditions, such as on cloudy or hazy days.\nThe down side of having flat-mounted PV modules is that they tend to get dirty from\nrain water and dust. See Figure 14. It is therefore better to mount the PV modules at an\nincline (10-15o for framed modules, or as little as 3-5o for unframed modules), to allow\nrain water to properly drain off\nFigure 14. PV module frames trap dirt as water evaporates from a\nflat-mounted PV module","metadata":1258}
{"text":"2.3 Avoid Shading PV Modules\nPV modules should be free from shade. Shading of any single cell of a crystalline silicon\nPV module will drastically reduce the output of the entire PV module.\nThin film PV modules are more tolerant to partial shading than crystalline silicon PV\nmodules. Typical culprits include shadows cast by tall trees and neighbouring buildings.","metadata":363}
{"text":"2.4 Aesthetic and Creative Approaches in Mounting PV Modules\nBesides mounting PV modules on the rooftop, customised PV modules can be\nintegrated into the building façade in a creative, aesthetically pleasing manner. They can\nbe mounted on any part of the rooftop or external walls that is well exposed to sunlight\ne.g. skylights, cladding, windows, and external shading devices.\nThey can also be integrated into external structures such as façades and canopies, as\nshown in Figure 15 and Figure 16, respectively.\nFigure 15. BIPV modules integrated\ninto a façade\nFigure 16. BIPV modules integrated into a\nskylight canopy","metadata":619}
{"text":"2.5 Solar PV Output Profile\nSolar PV only produces electricity when sunlight is available. The output of a solar PV\nsystem varies with its rated output, temperature, weather conditions, and time of the\nday. The power output profile of the PV installation as shown in Figure 17, at a selected\ntest site in Singapore collected over a period from 2002-2004, in terms of its capacity\nfactor, shows a high variation of solar PV output.\nPV Output capacity factor = Ratio of the actual output of the PV installation at time (t) over its output if it\nhad operated at full rated output.\nFigure 17. Varying daily power output profile of PV installation\nat a selected test site in Singapore","metadata":679}
{"text":"2.6 Solar PV Yield\nThe amount of electricity you are able to generate from a solar PV system depends not\nonly on the availability of sunshine but also on the technology you choose to install. For\nexample, a typical 10-kW rooftop solar PV system in Singapore would produce about\n11,000 to 12,500 kWh annually using crystalline PV modules, and 12,000 to 14,500 kWh\nannually with amorphous silicon thin film PV modules.","metadata":416}
{"text":"The cost of your solar PV system will depend on many factors: system configuration,\nequipment options, labour cost and financing cost. Prices also vary depending on factors\nsuch as whether or not your home is new, and whether the PV modules are integrated\ninto the roof or mounted on the roof. The cost also depends on the system size or\nrating, and the amount of electricity it produces.\nGenerally, solar PV systems entail high capital costs. With solar power, you can save on\nthe purchase of electricity from the grid. But even with these savings, it will take a long\ntime to recover the capital cost of the solar PV installation. The operating costs for solar\nPV installations are negligible, but the annual maintenance cost beyond the warranty\nperiod may amount to 0.5% to 1% of the capital cost of the installation.\nTherefore on an overall basis, solar PV-derived electricity is still much more expensive\nthan that from the power grid. However, the cost of solar PV has historically been falling\nby about 4% a year, and if this continues, solar PV may be competitive within the next\n10 years. For incentives on solar PV system, please refer to Appendix D.","metadata":1160}
{"text":"3.1 Introduction\nYou will need to select a contractor to install your solar PV system. If interested, you\nmay check with the following organisations for some solar PV system designers and\ncontractors:\n• The List of Solar PV System companies in Singapore, available from Sustainable\nEnergy Association of Singapore, by calling 6338 8578 or by visiting\nhttp:\/\/www.seas.org.sg\/about-seas\/our-committees\/cleanenergy\/54\n• The Singapore Sustainable Development Industry Directory 2008\/2009, available\nfrom the Singapore Business Federation, by calling 6827 6838 or by visiting\nhttp:\/\/www.sbf.org.sg\/public\/publications\/industrydirectory.jsp\nYour contractor will appoint a Licensed Electrical Worker (\"LEW\") who will be responsible\nfor the design, installation, testing, commissioning, and maintenance of your solar PV\nsystem.\nIn the case of non-residential electrical installations that require an electrical installation\nlicence, the appointed LEW who supervises the electrical work (\"Design LEW\") may\nnot be the one who takes charge of your electrical installation (\"Installation LEW\"). The\nDesign LEW will then have to work with the Installation LEW to work out the technical\nissues.\nPlease refer to Appendix B for details on how you can engage an LEW and the necessary\nconsultation process.","metadata":1288}
{"text":"3.2 Getting Started\nFirst, compile a list of potential solar PV system contractors. Next, contact the\ncontractors to find out the products and services they offer. The following pointers may\ngive consumers a good sense of the contractor’s capabilities:\nGet an experienced and licensed contractor\nExperience in installing grid-connected solar PV systems is invaluable, because some\nelements of the installation process, particularly interconnection with the grid, are\nunique to these systems. A contractor with years of experience will also demonstrate\nan ability to work with consumers, and price their products and services competitively.\nIt is also important to get a contractor who is an LEW.","metadata":695}
{"text":"Choosing between bids\nIf there are several bids for the installation of a solar PV system (it is generally a good\npractice to obtain multiple bids), consumers should take steps to ensure that all of\nthe bids received are made on the same basis. Comparing a bid for a solar PV system\nmounted on the ground against another bid for a rooftop system is like comparing apples\nto oranges.\nBids should clearly state the maximum generating capacity of the solar PV system\n[measured in watts peak (Wp) or kilowatts peak (kWp)]. If possible, the bids should\nspecify the system capacity in AC watts, or specify the output of the system at the\ninverter.\nBids should also include the total cost of getting the solar PV system components,\nincluding hardware, software, supporting structure, meter, installation, connection to the\ngrid (if applicable), permitting, goods and services tax, warranty, and future maintenance\ncost (if applicable).","metadata":928}
{"text":"Solar PV system warranty\nA solar PV system is an investment that should last a long time, typically two to three\ndecades for grid-connected applications. The industry standard for a PV module warranty\nis 20-25 years on the power output.\nThere are two main components to a PV module warranty:\n• A workmanship warranty that offers to repair, replace or refund the purchase\nin case of defects. The period varies from one to as long as ten years,\ndepending on the manufacturer. Two to five years is typical; and\n18\n• A limited power output warranty that offers a variety of remedies in case the\nPV module’s output under STC drops below certain level. Most manufacturers\nwarrant at least 90% of the minimum rated output for 10 years, and 80% of\nthe minimum rated output for 20-25 years. Take note that the minimum rated\noutput is usually defined as 95% of the rated output to allow for manufacturing\nand measurement tolerances. See Figure 18 for details.\nFigure 18. Understanding a manufacturer’s limited power warranty\nTake note that under the limited power warranty, manufacturers seldom offer to replace\nthe PV module itself. Rather, at their sole discretion, they may offer to:\n• Repair the defective PV modules;\n• Supply enough new PV modules to replace the lost power output in a PV\narray. For example, if your 20kW PV array only produces 16.1kW under STC,\nsix years after installation, the manufacturer may opt to supply you with 1kW\nof PV modules to make up for the shortfall; or\n• Refund you for the lost power output, after deduction according to the number\nof years in use. For a 25-year warranty, the annual deduction is normally 4%.\nFor example, if you find that your 20kW PV array only produces 16.1kW under\nSTC, six years after installation, the manufacturer may opt to reimburse your\npurchase price minus 24% (6 years x 4%).","metadata":1835}
{"text":"In all cases, the manufacturer does not cover your costs of dismounting, transporting,\nand reinstalling the PV modules. The warranty also excludes problems resulting from\nimproper installations; repairs, changes or dismounting by unqualified personnel;\naccidental breakage or abuse; lightning strikes and other acts of God.\nSignificantly, most manufacturers specify that the PV module output will be determined\nby the flash testers in their own premises, rather than by a third party.\nThe solar PV system contractor should assist in determining whether a PV module\ndefect is covered by warranty, and should handle the situation with the manufacturer.\nRegular maintenance\nDuring the defect liability period (usually for 12 months after installation), solar PV system\ncontractors usually use remote monitoring data to prepare monthly performance reports\nof the installed solar PV system. They should come on site to rectify any problems\nflagged by the remote monitoring service.","metadata":976}
{"text":"Other relevant matters\nAnother matter to be aware of is that PV module manufacturers are constantly upgrading\ntheir products, and adapting new sizes and dimensions to suit market requirements.\nThis means that you may no longer be able to buy an identical PV module to replace\na defective one in your PV array a few years after installation. Newer PV modules are\nlikely to be more efficient or have different physical dimensions, and may no longer fit\nexactly into the gap left by the old PV module.\nThis does not matter much on a large, ground-mounted solar PV power plant, because\nthe new modules can form a new row. But on a building-mounted solar PV system it\nmay spoil the aesthetics, and may cause problems to the electrical configuration.","metadata":744}
{"text":"4.1 Electrical Installation Licence\nAn electrical installation refers to any electrical wiring, fitting or apparatus used for\nthe conveyance and control of electricity in any premises. A solar PV system installed\nwithin such premises forms part of the consumer’s electrical installation and should\ncomply with the requirements stipulated in the Electricity Act (Cap. 89A), the Electricity\n(Electrical Installations) Regulations and the Singapore Standard CP5 Code of Practice\nfor Electrical Installations.\nUnder the Electricity Act, the Energy Market Authority (\"EMA\") licenses all nonresidential\nelectrical installations, with demand exceeding 45 kilo volt ampere or kVA. For\nresidential electrical installations and non-residential electrical installations with demand\nbelow the threshold 45kVA, no electrical installation licence is required.\nThe licence requires the owner of the electrical installation to engage an LEW to take\ncharge of the electrical installation and comply with the relevant safety standards and\nrequirements. Your appointed LEW shall consult SP PowerGrid Ltd on their technical\nrequirements and procedures, if you wish to operate your solar PV system in parallel\nwith the power grid. The objective is to ensure all electrical installations, including solar\nPV systems, are safe to use.","metadata":1311}
{"text":"4.2 Electrical Safety Standards and Requirements\nA grid-connected solar PV system operates in parallel with the power grid supply. The\npower grid supply is considered the source, and the electrical installation with the solar\nPV system connected is considered as the load.\nThe technical requirement for installation of a solar PV system is given in Section 612 of\nthe Singapore Standard CP5.\nThere are international product standards on PV modules and electrical components. For\nexample, PV modules should comply with the requirements of IEC 61215 for crystalline\nsilicon terrestrial PV modules or IEC 61646 for thin-film terrestrial PV modules. In\naddition, PV array junction box, PV generator junction box and switchgear assemblies\nshould comply with the requirements of IEC 60439-1.","metadata":785}
{"text":"4.3 Application of Electrical Installation Licence\nYour LEW will be able to advise you whether you need to apply to EMA for an Electrical\nInstallation Licence for the use or operation of the electrical installation within the\npremises of your building.\nIf an Electrical Installation Licence is needed, your LEW will submit the licence application\nto EMA on your behalf. If you already have an Electrical Installation Licence issued by\nEMA, you need not apply for a separate licence for the solar PV system within the same\npremises.\nThe electrical licence fee payable to EMA is $100 per year (exclusive of goods and\nservices tax).","metadata":629}
{"text":"4.4 Conservation and Development Control Requirements\nAt present, there is no specific requirement or control by the Urban Redevelopment\nAuthority (\"URA\") on the use of installations such as a solar PV system. However,\nconservation projects, or projects within the Central Area are subject to URA’s Urban\nDesign evaluation process.\nThe standard development control guidelines apply to projects that may not be subject\nto conservation or urban design requirements, depending on which structure(s) the\nsolar PV system is installed onto. For example, if a solar PV system is installed on the\nrooftop of an attic, then the attic guidelines will apply. Likewise, if a solar PV system is\ninstalled on raised structures like a pavilion, then the pavilion guidelines will apply.","metadata":770}
{"text":"4.5 Guidelines on Conservation and Development Control\nArchitects are advised to refer to the conservation and development control guidelines\nwhen designing a development with a solar PV system installation. The respective\nguideline is available at URA’s website:\nhttp:\/\/www.ura.gov.sg\/conservation\/Cons%20Guidelines.pdf\nhttp:\/\/www.ura.gov.sg\/circulars\/text\/dchandbook.html\nShould you have further enquiries on whether your installations conflict with the Urban\nDesign or Development Control guidelines, you may submit your enquiries to URA either\nin person or through a Qualified Person (\"QP\") — a QP is either a registered architect\nor an engineer — with the accompanying plans of the structures on which the solar PV\nsystem will be installed:\nConserved buildings\nEmail: ura_conservation_cso@ura.gov.sg\nTel: 6329 3355\nNon-conserved buildings\nEmail: ura_dcd@ura.gov.sg\nTel: 6223 4811\nShould a formal development application to URA be required, it must be made via a QP.\nThe details can be checked at the two web links below:\nhttp:\/\/www.boa.gov.sg\/register.html\nhttp:\/\/www.peb.gov.sg\/peb\/process\/searchPe","metadata":1104}
{"text":"4.6 Structural Safety and Lightning Protection\nStructural Safety\nTo ensure safety, there are measures and steps that need to be taken or considered\nwhen installing a solar PV system onto a new or an existing building. For new building\ndevelopments, the design of the structure must take into consideration the loading of\nthe solar PV system installation, just like any other equipment mounted onto a building\nstructure.\nFor existing buildings, a professional structural engineer may be required to carry out an\ninspection of the roof structure, and do a calculation on the structural loading. If the roof\nis unable to withstand the loading of the solar PV system, structural plans will need to\nbe submitted to the Building and Construction Authority (\"BCA\") for approval before a\nbuilding permit can be issued for commencement of installation works. The application\nguideline is available at the following BCA’s website:\nhttp:\/\/www.bca.gov.sg\/StructuralPlan\/structural_plan_application.html","metadata":990}
{"text":"Lightning Protection\nGiven a certain location, solar PV systems are exposed to the threat of lightning strikes.\nAs lightning can cause damage to the PV modules and inverters, extra care must be\ntaken to ensure that proper lightning protection is provided for the solar PV system and\nthe entire structure. The inverters should be protected by appropriately rated surge\narrestors on the DC side. It is good practice to also install surge arrestors on the AC side.\nStructures and PV module frames must be properly grounded.","metadata":520}
{"text":"4.7 Connection to the Power Grid\nIf a solar PV system is designed to meet only a fraction of the electricity load, the\nsystem will need to be interconnected with the power grid to meet the remainder of the\nconsumer’s needs for electricity.\nIf a solar PV system needs to be grid-connected, interconnection is key to the safety of\nboth consumers and electrical workers, and to the protection of equipment.","metadata":403}
{"text":"4.8 Get Connected to the Power Grid\nIf you intend to connect and operate your solar PV system in parallel to the power grid,\nyour appointed LEW will have to consult SP PowerGrid (\"SPPG\") on the connection\nscheme and technical requirements.\nThe following documents set out the detailed consultation process and technical\nrequirements:\n• The Transmission Code and the Metering Code are published at EMA’s website:\nhttp:\/\/www.ema.gov.sg\/media\/files\/codes_of_practice\/electricity\/transmission_\ncode.pdf\nhttp:\/\/www.ema.gov.sg\/media\/files\/codes_of_practice\/electricity\/Metering_\nCode.pdf\n• SPPG’s handbook, How to Apply for Electricity Connection, is published at SP\nPowerAsset’s website:\nhttp:\/\/www.sppowerassets.com.sg\/PDF\/howtoapply.pdf","metadata":733}
{"text":"4.9 Sale of Solar PV Electricity\nThe excess electricity generated from a grid-connected solar PV can be sold back to the\npower grid. The arrangements needed to enable this sale of solar PV electricity vary,\ndepending on whether you are a contestable or non-contestable consumer.\nConsumers are classified, based on their average monthly electricity consumption,\ninto:\n• Contestable consumers: These consumers are the non-residential consumers who\nuse more than 10,000 kWh of electricity a month. Contestable consumers have a\nchoice of who they wish to buy their electricity from. They may purchase electricity\nfrom a retailer, directly from the wholesale market (provided they are registered\nwith the Energy Market Company as market participants) or indirectly from the\nwholesale market through SP Services.\n• Non-contestable consumers: These consumers comprise all the residential electricity\nusers and non-residential consumers who use less than 10,000 kWh of electricity a\nmonth. These consumers are supplied with electricity by SP Services.","metadata":1043}
{"text":"Contestable Consumers\nIf you are a contestable consumer generating electricity from a solar PV system and\nwish to sell and get paid for the electricity you inject into the power grid, you will be\nrequired to register with the Energy Market Company (\"EMC\") to participate in the\nwholesale electricity market, which is called the National Electricity Market of Singapore\nor NEMS.\nFigure 19. Flowchart for Electricity Licences\nThe flowchart in Figure 19 describes the circumstances under which the Generation\nLicence or Wholesaler (Generation) Licence is required.\nGeneration Licence or\nWholesaler (Generation)\nLicence not required\nApply to EMA for\nGeneration Licence\nApply to EMA for\nWholesaler\n(Generation) Licence\nProposed Generation Unit\n(e.g. Cogen, PV system, etc.)\nGeneration Capacity < 1MW\nGeneration Capacity ≥ 10 MW?\n1MW ≥ Generation Capacity < 10 MW? Connected to\npower grid?\nYes\nYes Yes\nNo\nNo No","metadata":904}
{"text":"The application procedures to register as a Market Participant with the EMC and for\ngeneration facility registration are set out in the Market Manual: Market Administration–\nRegistration and Authorisation, which is available at the EMC website:\nhttp:\/\/www.emcsg.com\/MarketRules\/MarketManuals\nAs a Market Participant, you will need to comply with the Market Rules, which is available\nat EMC’s website:\nhttp:\/\/www.emcsg.com\/MarketRules\nBy selling electricity in the wholesale electricity market, you will be paid the prevailing\nelectricity spot price for the electricity that you inject into the power grid. The electricity\nspot price varies every half-hour, depending on the demand-supply situation in the\nwholesale electricity market.\nThe market will also offer services and system resources to you, but you will be subjected\nto market charges in respect to the gross generation output from your registered PV\nsystem, for the provision of the market services and system resources.\nThe EMC contact is:\nMarket Administration Team\nEnergy Market Company\n238A Thomson Road, #11-01 Novena Square Tower A, S307684\nTelephone: 67793000\nE-mail: info@emcsg.com","metadata":1149}
{"text":"If you are a non-contestable consumer generating electricity of less than 1 MW and\nwish to sell and get paid for the electricity you inject into the power grid, you need not\napply for a Generation or Wholesaler (Generation ) Licence nor register with the EMC\nas a market participant. You will have to apply to SP Services (\"SPS\") by following the\napplication procedure set out in Appendix B.\nNon-contestable consumers are compensated by SPS for electricity exported to the\npower grid by way of a credit adjustment to the consumer’s monthly electricity bill,\nbased on the prevailing low-tension electricity tariff less the grid charge.\nThe credit adjustment will effectively compensate the non-contestable consumer for\nthe amount of electricity exported into the power grid during that month.\nThis scheme to compensate non-contestable consumers with generation capacity of\nless than 1MW for the electricity they export into the power grid is not applicable to\nthose consumers whose electricity consumption is metered under the master-sub\nmetering scheme.\nMaster-sub metering schemes refer to metering arrangements where there is a\nmaster-meter measuring the overall electricity consumed by the building (i.e. both the\nindividual units and the common services), with sub-meters measuring the usage of the\nindividual units. Such metering schemes are typically used in private condominiums\nand commercial buildings.\nUnder a master-sub metering arrangement, the electricity that an individual unit attempts\nto export into the grid may in fact be used up by the common services or by other\nindividual units. As it is not possible to track the actual flow of the electricity exported\nby the individual units, the credit adjustment scheme cannot be applied to those under\nthe master-sub metering scheme.","metadata":1795}
{"text":"5.1 Operations of Solar PV Systems\nThe most practical indicator of the performance of the solar PV systems can be obtained\nfrom the remote monitoring and data logging software supplied by most inverter\nmanufacturers.\nThe data logging software will record daily, monthly, and annual output for comparison of\nthe actual system performance against the expected system performance. See Figure\n20 for typical performance monitoring displays. \nFigure 20. Examples of performance monitoring displays (Courtesy of Phoenix Solar)\nSolar PV systems require minimal maintenance, as they do not usually have moving\nparts. However, routine maintenance is required to ensure the solar PV system will\ncontinue to perform properly.\nIt is a good practice for contractors of solar PV systems to provide an operation &\nmaintenance (\"O&M\") manual for the client. The manual should include basic system\ndata, test and commissioning data, O&M data, and warranty information.","metadata":951}
{"text":"AppendAix A.1 ZERO ENERGY BUILDING @ BCA ACADEMY\nBuilding name : Zero Energy Building @ BCA Academy\nOwner : Building and Construction Authority (BCA)\nLocation : 200 Braddell Road, Singapore 579700\nBuilding type : Academic Institution\nCompletion : 2009\nWorking groups\n• Project architects : DP Architects Pte Ltd\n• Principal investigators : National University of Singapore \/ SERIS\n• Structural engineers : Beca Carter Hollings & Ferner (S. E. Asia) Pte Ltd\n• M&E engineers : Beca Carter Hollings & Ferner (S. E. Asia) Pte Ltd\n• Quantity surveyor : Davis Langdon & Seah Singapore Pte Ltd\n• Contractors : ACP Construction Pte Ltd\n• PV design : Grenzone Pte Ltd\n• PV manufacturer : Various (7 manufacturers)\nType of PV integration : on Metal Roof, Canopy, Louver, Railing, Façade\nType of PV cell technology : Various (mc-Si, pc-Si, a-Si, HIT, CIGS)\nPV area (m2) : 1,540\nPV system peak power (kWp) : 190\nEstimated energy output (kWh \/ yr) : 207,000\nPV Yield (kWh \/ kWp \/ year) : 1,090\nPhotographs and information\ncourtesy of : BCA \/ Grenzone Pte Ltd\nFigure A.1.1. Building exterior\nFigure A.1.3. PV array view (PV Main Roof)\nFigure A.1.2. PV array view (PV Sunshade)\nFigure A.1.4. PV array view (PV Staircase\nFacade)\nThe Solar Photovoltaic System installed at BCA Academy’s Zero-Energy\nBuilding (ZEB) consists of 12 systems with six systems connected to grid and\nsix standalone systems. Featuring different types of Solar PV technology and\nmounting techniques, the ZEB @ BCA Academy’s Solar PV system is designed\nto achieve zero-energy and for advance academic research on various PV\nperformances.","metadata":1593}
{"text":"AppendAix A.2 POH ERN SHIH(TEMPLE OF THANKSGIVING)\nBuilding name : POH ERN SHIH (Temple of Thanksgiving)\nOwner : POH ERN SHIH\nLocation : 9 Chwee Chian Road, Singapore 117488\nBuilding type : Religious\nCompletion : 2006 (Phase I)\nWorking groups\n• Project architects : Lee Coo Consultant Associates\n• Structural engineers : KTP Consultants Pte Ltd\n• M&E engineers : Squire Mech Pte Ltd\n• Quantity surveyor : WT Partnership International Limited\n• Contractors : Wee Hur Construction Pte Ltd\n• PV design : Grenzone Pte Ltd\n• PV manufacturer : Uni-Solar, Sharp, Mitsubishi\nType of PV integration : Standing Mounting Structure\nType of PV cell technology : Amorphous Monocrystalline Polycrystalline\nsilicon silicon silicon\nPV area (m2) : 36.1 39.2 84.7\nPV system peak power (kWp) : 2.232 5.250 11.340\nEstimated energy output (kWh \/ yr) : 2,566 6,036 13,038\nPV Yield (kWh \/ kWp \/ year) : 1,150 1,150 1,150\nPhotographs and information\ncourtesy of : Grenzone Pte Ltd\nThe PV arrays are mounted on the rooftop with standing mounting structure,\nallowing sufficient ventilation to improve PV performance. About 25% of\nelectrical power demand in the building are supplied by the solar PV system.\nFigure A.2.1. Building exterior Figure A.2.2. Building interior\nFigure A.2.3. PV array view Figure A.2.4. PV array view","metadata":1299}
{"text":"AppendAix A.3 313 SOMERSET CENTRAL\nBuilding name : 313 SOMERSET CENTRAL\nOwner : Lend Lease Retail Investment 1 Pte Ltd\nLocation : 313 Orchard Road, Singapore 238895\nBuilding type : Shopping Mall\nCompletion : 2009\nWorking groups\n• Project architects : Aedas Pte Ltd\n• Structural engineers : Meinhardt Infrastructure Pte Ltd\n• M&E engineers : Bescon Consulting Engineers Pte Ltd\n• Quantity surveyor : WT Partnership Pte Ltd\n• Contractors : Bovis Lend Lease Pte Ltd\n• PV design : Grenzone Pte Ltd\n• PV manufacturer : Various (4 manufacturers)\nType of PV integration : on Trellis and Metal Roof\nType of PV cell technology : Monocrystalline, Polycrystalline, Micromorph\nPV area (m2) : 587\nPV system peak power (kWp) : 76\nEstimated energy output (kWh \/ year) : 87,381\nPV Yield (kWh \/ kWp \/ year) : 1,150\nPhotographs and information\ncourtesy of : Bovis Lend Lease\n313 Somerset Central is centrally located in the heart of Singapore’s famous\nOrchard Road. The solar photovoltaic system consists of four PV arrays, with\na main PV array of 60 kWp mounted on the trellis, and three smaller arrays\nfeaturing monocrystalline, polycrystalline and micromorph solar modules that\nare accessible by visitors.\nFigure A.3.1. Building exterior\nFigure A.3.2. Building exterior\nArchitect’s Impression of Somerset Central viewed from Orchard Road","metadata":1322}
{"text":"Building name : Private\nOwner : Private\nLocation : Sentosa Cove, Singapore\nBuilding type : Two-storey bungalow with basement\nCompletion : July 2008\nWorking groups\n• Project architects : Guz Architects\n• M&E consultant : Herizal Fitri Pte Ltd\n• PV design : Phoenix Solar Pte Ltd\n• Main contractors : Sunho Construction Pte Ltd\n• Roofing contractor Sheet Metal International\n• PV manufacturer : Uni-Solar\nType of PV integration : Glued onto approved Fazonal metal roof\nType of PV cell technology : Flexible amorphous silicon\nPV area (m2) : 92\nPV system peak power (kWp) : 5.712\nEstimated energy output kWh \/ yr) : 7,100\nPV Yield (kWh \/ kWp \/ yr) : 1,250\nPhotographs and information : Phoenix Solar Pte Ltd,\ncourtesy of Guz Architects, and Sheet Metal International\nThis striking house stands out for its open layout, capped with twin curved roofs. The rear\nroof has a turf lawn to keep it cool, while the front roof generates electricity with flexible\nsolar laminates, bonded unobtrusively on top. This configuration meets Sentosa Resort\nManagement’s strict guidelines for roof aesthetics, which do not generally permit bare\nmetal roofs on bungalow developments.\nThanks to the laminates’ light weight (less than 4kg\/m2), the roof can make do with a\nlighter and lower substructure cost than if it had to carry conventional clay tiles.\nFigure A.4.1.\nTwin curved roofs,\ngreen grass and PV\nFigure A.4.2.\nLightweight, flexible\nlaminates follow the\ncurved roof\nFigure A.4.3.\nTesting the Uni-Solar\nlaminates during\ninstallation\nAppendix A.4\nSentosa Cove","metadata":1544}
{"text":"AppendAix A.6 Lo nza Biologics\nBuilding name : LBXS2\nOwner : Lonza Biologics Tuas Pte Ltd\nLocation : Tuas, Singapore\nBuilding type : Biotech factory and laboratory\nCompletion : May 2009\nWorking groups\n• Project architects : RSP Architects Planners & Engineers Pte Ltd\n• M&E engineers : Jacobs Engineering Singapore Pte Ltd\n• PV design : Phoenix Solar Pte Ltd\n• Contractors : Bovis Lend Lease Pharmaceutical Pte Ltd\n• PV manufacturer : REC (framed modules) and Solar-Fabrik (frameless\nlaminates)\nType of PV integration : Roof mounted on Bluescope Lysaght KlipLok metal roof\nType of PV cell technology : Polycrystalline silicon\nPV area (m2) : 1,330\nPV system peak power (kWp) : 181\nEstimated energy output (kWh\/yr) : 217,000\nPV Yield (kWh\/kWp\/yr) : 1,200\nPhotographs and information : Phoenix Solar Pte Ltd\ncourtesy of and Lonza Biologics Tuas Pte Ltd\nThe curved laboratory roof of the Lonza Biologic’s LBXS2 factory offers prominent\nvisibility to maximise public awareness for a 181kWp solar PV system on an industrial\nbuilding. The bulk of the PV array consists of 744 pieces of REC210 modules, while\nthe flatter upper section of the roof is covered with 104 SF130\/2 frameless laminates\nfrom Solar-Fabrik. Without frames to trap water at shallow installation angles, these\nlaminates will avoid dirt accumulation.\nRoof clamps were specially engineered to attach the PV module rails to the KlipLok roof\nseams without any penetrations. Lonza Biologics was a recipient of one of the inaugural\nSolar Pioneer grants under EDB’s Solar Capability Scheme.\nFigure A.6.3. Installing the REC modules\nFigure A.6.1. Building exterior (Rendering by RSP Architects Planners &\nEngineers Pte Ltd)\nFigure A.6.2. Modules installed on the\n6o-16o slope","metadata":1730}
{"text":"AppendAix A.7 Zero Energy House\nBuilding name : Zero Energy House\nOwner : Private\nLocation : District 15, Singapore\nBuilding type : Residential, 21\/2-storey semi-detached house\nCompletion (renovation) : April 2008\nWorking groups\n• Project architects : Art & Architecture Collaborative\n• Structural engineers : Portwood & Associates\n• PV design : Phoenix Solar Pte Ltd\n• Contractors : MCL Construction & Engineering Pte Ltd\n• PV manufacturer : Mitsubishi Heavy Industries and Phoenix Solar\nType of PV integration : Roof mounted on metal roof\nType of PV cell technology : amorphous silicon and micromorph silicon thin films\nPV area (m2) : 120\nPV system peak power (kWp) : 8.58\nEstimated energy output (kWh\/year) : 12,000\nPV Yield (kWh\/kWp\/yr) : 1,400\nPhotographs and information\ncourtesy of : Phoenix Solar Pte Ltd\nFigure A.7.2. West roof flank with micromorph PV modules\nFigure A.7.1. Building roof with two types of PV module\nThis 1960s semi-detached house was converted into Singapore’s first modern zero-energy\nhome by reducing solar heat gain, improving natural ventilation and adding a rooftop solar\nPV system, which generates more electricity than the 6-person household consumes.\nThe PV modules are mounted on rails that are clamped to the seams of the aluminium\nKalzip roof without any roof penetrations. As an important added benefit, the PV modules\nshade the roof, keeping the attic rooms much cooler than they would be under a roof fully\nexposed to the sun.","metadata":1467}
{"text":"AppendAix A.8 Tampines Grande\nBuilding name : Tampines Grande\nOwner : City Developments Ltd\nLocation : Tampines, Singapore\nBuilding type : Office building\nCompletion : May 2009\nWorking groups\n• Project architects : Architects 61 Pte Ltd\n• M&E engineers : Conteem Engineers Pte Ltd\n• PV design : Phoenix Solar Pte Ltd\n• Contractors : Dragages Singapore Pte Ltd \/ BYME Singapore\n• PV manufacturer : Suntech (rooftop) and Schott Solar (BIPV)\nType of PV integration : Roof mounted and Building Integrated façade\nType of PV cell technology : Monocrystalline silicon and amorphous silicon thin film BIPV\nPV area (m2) : 934\nPV system peak power (kWp) : 107\nEstimated energy output (kWh\/yr) : 120,000\nPV Yield (kWh\/kWp\/yr) : 1,200\nPhotographs and information : Phoenix Solar Pte Ltd\ncourtesy of and City Developments Ltd\nFigure A.8.1. 6kWp BIPV façade on Tower 2\nFigure A.8.2. Partially completed PV array Figure A.8.3. Aerial view of both towers\n101kWp of monocrystalline PV modules form the main rooftop PV array on Towers 1 and\n2, while the west façade of Tower 2 has 6kWp of BIPV comprising 40 large, custom-built\namorphous silicon thin film modules.\nAt the time of completion, this was Singapore’s largest PV system, and the first\ncommercial application of a thin film BIPV façade.\nThe building also boasts a solar air-conditioning system powered by solar thermal\ncollectors.\nTampines Grande was a recipient of one of the inaugural Solar Pioneer grants under\nEDB’s Solar Capability Scheme.","metadata":1486}
{"text":"AppendAix A.9 HD B APARTMENT BLOCKS\na t Serangoon North Precinct\nBuilding Name : HDB Apartment Blocks at Serangoon North Precinct\nOwner : Ang Mo Kio- Yio Chu Kang Town Council\nLocation : Serangoon North Avenue 3 Block 548 to 554\nand 550A (Multi-storey Carpark)\nBuilding type : Residential\nCompletion : 2008\nWorking groups\n• Contractors : King Wan Construction Pte Ltd &\nAsiatic Engineering Pte Ltd\n• PV manufacturer : Sunset Energietechnik GmbH\nType of PV integration : Roof top\nType of PV cell technology : Mono-crystalline silicon\nPrecinct PV area (m2) : 667.61\nPrecinct PV system peak power (kWp) : 75.75\nEstimated energy output (kWh \/ yr) : 80,300\nPV Yield (kWh \/ kWp\/yr) : 1,060\nPV Photographs and information\ncourtesy of : HDB\nFigure A.9.1. Typical rooftop PV array layout at Serangoon North Precinct\nThe Serangoon North Precinct consists of\nfive blocks of 16 storey and two blocks of\nnine storey residential apartments and a multi\nstorey car park (MSCP). Sixty-nine pieces of\nsolar PV panels are mounted at the rooftop\nof each residential block and 22 pieces of the\npanel at the staircase roof of the MSCP.","metadata":1113}
{"text":"AppendAix A.10 HDB APARTMENT BLOCKS at Wellington Circle Precinct\nBuilding Name : HDB Apartment Blocks at Wellington Circle Precinct\nOwner : Sembawang Town Council\nLocation : Wellington Circle 508A-C, 509A-B, 510A-B & 508 (MSCP)\nBuilding type : Residential\nCompletion : 2008\nWorking groups\n• Contractors : King Wan Construction Pte Ltd &\nAsiatic Engineering Pte Ltd\n• PV manufacturer : Sunset Energietechnik GmbH\nType of PV integration : Roof top\nType of PV cell technology : Mono-crystalline silicon\nPrecinct PV area (m2) : 667.61\nPrecinct PV system peak power (kWp) : 75.75\nEstimated energy output (kWh \/ yr) : 80,300\nPV Yield (kWh \/ kWp\/ yr) : 1,060\nPhotographs and information\ncourtesy of : HDB\nFigure A.10.1. Typical rooftop PV array layout at Wellington Circle Precinct\nThe Wellington Circle Precinct consists\nof seven blocks of 12 storey residential\napartments and a MSCP. Sixty-nine pieces\nof solar PV panels are mounted at the rooftop\nof each residential block and 22 pieces of the\npanel at the staircase roof of the MSCP.","metadata":1031}
{"text":"Electrical Worker\n1. Engaging a Licensed Electrical Worker (LEW)\n1.1 There are three classes of LEWs: Licensed Electrician, Licensed Electrical Technician, and\nLicensed Electrical Engineer. The various classes of LEWs are authorised to design, install,\nrepair, maintain, operate, inspect and test electrical installations according to the conditions\nstated below:\nClass of LEW\tApproved Load Voltage Level\nElectrician Not exceeding 45 kVA 1000V & below\nElectrical Technician Not exceeding 150 kVA\n(Design); not exceeding 500 kVA\n(Operation) 1000V & below\nElectrical Engineer No limit Subject to license conditions\n1.2 The Singapore Standard for electrical safety applicable to solar PV Systems is set out in\nthe Code of Practice for Electrical Installations (Singapore Standard CP5:2008), which is\npublished by SPRING Singapore. The LEW whom you appoint to carry out or supervise the\nelectrical works associated with your PV system will be responsible for the compliance\nwith the relevant safety standards and requirements.\n1.3 You can search for LEWs and their contact particulars at the following EMA website:\nhttp:\/\/elise.ema.gov.sg\n1.4 For enquiries on LEWs, you can contact EMA’s Electricity Inspectorate Branch at:\nTel: 6835 8060\nEmail: ema_enquiry@ema.gov.sg\n2. Guide for consumers – Installation of Solar PV Systems","metadata":1322}
{"text":"For enquiries on the following matters pertaining to Solar PV systems, please contact:\n(1) Buildings issues Building And Construction Authority (BCA)\nEmail: bca_equiry@bca.gov.sg\nTel: 1800-3425222 (1800-DIAL BCA)\n(2) Development Planning Control Urban Redevelopment Authority (URA)\n– Conserved Buildings Building Conservation\nEmail: ura_conservation_cso@ura.gov.sg\nTel: 6329 3355\n(3) Development Planning Control Urban Redevelopment Authority (URA)\n– Non-conserved Buildings Non-conserved buildings\nEmail: ura_dcd@ura.gov.sg\nTel: 6223 4811\n(4) Electricity Generation Licences Energy Market Authority (EMA)\nEconomic Regulation & Licensing Department\nEmail: ema_enquiry@ema.gov.sg\nTel: 6835 8000\n(5) Licensed Electrical Workers Energy Market Authority (EMA)\n(\"LEWs\") Electricity Inspectorate Branch\nEmail: ema_enquiry@ema.gov.sg\nTel: 6835 8060\n(6) Electricity market rules, Energy Market Company (EMC)\nmarket registration process, Market Administration Team\nand market charges Email: MPregistration@emcsg.com\nTel: 6779 3000\n(7) Connection to the power grid SP Services Ltd (SPS)\nEmail: install@singaporepower.com.sg\nTel: 6823 8283 \/ 6823 8284\n(8) Connection to the power grid SP PowerGrid Ltd (SPPG)\nEmail: dgconnection@singaporepower.com.sg\nTel: 6823 8572","metadata":1254}
{"text":"The Economic Development Board (EDB) unveiled the Solar Capability\nScheme to spur demand and build up expertise for this young but growing\nfield. The scheme – the latest by Clean Energy Programme Office (CEPO) –\nseeks to strengthen critical capabilities of companies engaged in activities\nsuch as engineering, architecture and system integration through increased\nimplementation of solar energy technologies by lead users in Singapore.\nAgency : EDB\nQuantum : $20 Million (Overall); $1 Million per project or up to 40% of\ntotal capital cost of solar technology.\nTarget Group : Engineering;\nArchitecture;\nSystem Integration\n(With implementation of solar energy technologies)\nFor Reading : http:\/\/www.edb.gov.sg\/edb\/sg\/en_uk\/index\/news\/articles\/\ncepo_launches_solar.html\nhttp:\/\/www.edb.gov.sg\/edb\/sg\/en_uk\/index\/news\/articles\/\nAward_Ceremony_for_Solar_Testbeds.html\nFor Details : http:\/\/www.edb.gov.sg\/etc\/medialib\/downloads\/industries.\nPar.98811.File.tmp\/Solar%20Capability%20Scheme%20Factsheet.pdf","metadata":996}
{"text":"The MDF seeks to incentivise the use of clean and renewable energy\nresources among non-residential consumers and developers by offsetting\nthe market charges and related costs associated with selling clean and\nrenewable energy into the power grid. This will help to promote energy\nefficiency as well as help in the market integration of innovative clean and\nrenewable energy resources.\nAgency : Energy Market Authority (EMA)\nQuantum : $5 million; $50,000 over a span of 5 years or 90% of incurred\nmarket charges for approved projects, whichever is lower.\nTarget Group : Non-residential consumers and developers who choose to sell\nexcess electricity generated from clean and renewable energy\ntechnologies to the power grid.\nFor Details : http:\/\/www.ema.gov.sg\/index.php?option=com_content&view=artic\nle&id=125&Itemid=141","metadata":818}
{"text":"The Green Mark Scheme was launched to promote environmental awareness\nin the construction and real estate sectors. It is a benchmarking scheme\nthat aims to achieve a sustainable built environment by incorporating best\npractices in environmental design and construction, and the adoption of\ngreen building technologies.\nAgency : Building and Construction Authority (BCA)\nTarget Group : Developers\nDesigners\nBuilders\nFor Reading : http:\/\/www.greenmark.sg\nhttp:\/\/www.bca.gov.sg\/GreenMark\/green_mark_buildings.html\nFor Details : http:\/\/www.bca.gov.sg\/greenmark\/others\/gmtc.pdf","metadata":572}
{"text":"To encourage the private sector to develop buildings that attain higher tier\nGreen Mark ratings (i.e. Green Mark Platinum or Green Mark GoldPLUS),\nBCA and the Urban Redevelopment Authority (URA) have introduced a set\nof Gross Floor Area (GFA) incentives on 29 Apr 2009. For developments\nattaining Green Mark Platinum or GoldPLUS, URA will grant additional floor\narea over and above the Master Plan Gross Plot Ratio (GPR) control.\nAgency : BCA and URA\nTarget Group : All new private developments, redevelopments and\nreconstruction developments submitted on or after the\neffective date.\nFor Details : http:\/\/www.bca.gov.sg\/GreenMark\/gmgfa.html","metadata":641}
{"text":"Scheme for existing buildings\n(GMIS-EB)\nThe GMIS-EB aims to encourage private building owners of existing\nbuildings to undertake improvements and\/or retrofits to achieve substantial\nimprovement in energy efficiency. It provides a cash incentive that cofunds\nup to 35% (capped at $1.5 million) of the upgrading\/retrofitting costs\nfor energy efficiency improvement in their existing buildings.\nAgency : BCA\nTarget Group : Building owners\/developers of private existing nonresidential\ndevelopments that is centrally air-conditioned,\nwith gross floor area of 2,000 sqm above e.g. energy\nintensive buildings such as shopping malls, hotels, office\nbuildings, hospitals, and other centrally air-conditioned\nbuildings.\nFor Details : http:\/\/www.bca.gov.sg\/GreenMark\/gmiseb.html","metadata":768}
{"text":"The GMIS-NB is to help accelerate the adoption of environmentallyfriendly\ngreen building technologies and building design practices. The\nenhanced scheme offers cash incentives.\nAgency : BCA\nTarget Group : Developers, building owners, project architects and M&E\nengineers who make efforts to achieve at least a BCA Green\nMark Gold rating or higher in the design and construction of\nnew buildings.\nFor Details : http:\/\/www.bca.gov.sg\/GreenMark\/GMIS.html","metadata":451}
{"text":"The information in this handbook is subject to change or revision, to adapt to the continual development and\nevolvement of the electricity and building and construction industries and is not a substitute for any law, regulation,\ncode of practice, standard of performance, Market Rules or Building Control Act which may apply to the said industries\nin Singapore. It does not in any way bind the Energy Market Authority (\"EMA\") and the Building and Construction\nAuthority (\"BCA\") to grant any approval or official permission for any matters, including but not limited to the grant\nof any exemption nor to the terms of any exemption. Both EMA and BCA reserve the right to change its policies\nand\/or to amend any information in this handbook without prior notice. Persons who may be in doubt about how the\ninformation in this handbook may affect them or their commercial activities are advised to seek independent legal\nadvice or any other professional advice as they may deem appropriate. Both Authorities assume no responsibility or\nliability for any consequences (financial or otherwise) suffered directly or indirectly by persons who have entered into\ncommercial activities upon reliance on any information in this document.\nEnergy Market Authority\n991G Alexandra Road, #01-29\nSingapore 119975\nTel: (65) 6835 8000\nFax: (65) 6835 8020\nBuilding and Construction Authority\n5 Maxwell Road\n#16-00 Tower Block MND Complex\nSingapore 069110\nMain Line: 1800-3425222 (1800-DIAL BCA)\nISBN: 978-981-08-4462-2","metadata":1496}
